Revit 2027 API
RenderingImageExposureSettings.Shadows Property
 The shadows value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Shadows { get; set; }
Public Property Shadows As Double
	Get
	Set
public:
property double Shadows {
	double get ();
	void set (double value);
}
member Shadows : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The value of shadows is not valid. The valid range is 0.1 to 4.
Remarks
 Increase this value to get darker shadows.
See Also
Reference
RenderingImageExposureSettings Class
Autodesk.Revit.DB Namespace